#!/usr/bin/env python
# encoding: utf-8

"""
运算符
@version: 1.0
@author: duanchao
@license: Apache Licence 
@file: Operation.py
@time: 2017/9/5 18:01
"""
####################################################################################################################
## 算术运算符
## + 加法
## - 减法
## * 乘法
## / 除法
## ** 幂
## // 取整除
####################################################################################################################
# 定义一些变量
a = 21
b = 10
c = 0

# + - * / 基础运算符
print '1 -- c的值为:', a + b
print '2 -- c的值为:', a - b
print '2 -- c的值为:', a * b
print '2 -- c的值为:', a / b
print '2 -- c的值为:', a % b


