#!/usr/bin/env python
# encoding: utf-8

"""
变量
@version: 1.0
@author: duanchao
@license: Apache Licence 
@file: Variable.py
@time: 2017/9/5 10:15
"""
####################################################################################################################
## String
####################################################################################################################
str_ = 'ilovepython'
print str_               # 直接输出
print str_[0]            # 输出下标对应字符
print str_[1:5]          # 截取字符串并输出
print str_[2:]           # 从第三个字符开始输出
print str_ * 2           # 输出两次
print str_ + 'TEST'     # 输出连接的字符串

####################################################################################################################
## List
####################################################################################################################
list_ = ['runoob', 786, 2.23, 0122L, 'john', 70.2]
tinylist = [123, 'j']

print list_
print list_[0]
print list_[1:5]
print list_[2:]
print list_ + tinylist
####################################################################################################################
## 元组 tuple  (元组的值不能被修改)
####################################################################################################################
tuple_ = ('runoob', 786, 2.23, 0122L, 'john', 70.2)
tinytuple = (123, 'j')

print tuple_
print tuple_[0]
print tuple_[1:5]
print tuple_[2:]
print tuple_ + tinytuple
####################################################################################################################
## 字典 dictionary
####################################################################################################################
dict_ = {}
dict_['one'] = 'this is one'
dict_[2] = 'this is two'

tinydict = {'name': 'john', 'code' : '1234', 'dept' : 'IT'}

print dict_
print dict_['one']
print dict_[2]
print tinydict
print tinydict.keys()
print tinydict.values()

####################################################################################################################
## 数据类型转换
####################################################################################################################
print int(3L)           # 转换成整数类型
print long(1)           # 转换成长整数
print float(1)          # 转换成浮点数
print complex(100)      # 创建一个复数
print str(dict)         # 转换成字符串
print repr(dict)        # 转换成表达式字符串
print eval('3 * 2')    # 执行一个字符串表达式
print tuple([1,2,3,4])  # 将一个序列转换成元组
print list(tuple_)      # 将一个序列转换成列表
print set('python')    # 创建一个无序的不重复的元素集
print dict(a = 'a', b = 'b')    # 创建一个字典
print frozenset([0, 1, 2])       # 创建一个不可变集合
print chr(100)            # 将一个整数转换为一个字符
print unichr(100)         # 将一个整数转换为Unicode字符
print ord('p')            # 将一个字符转换成它的整数值
print hex(16)             # 将一个整数转换为一个十六进制的字符串
print oct(8)              # 将一个整数转换为一个八进制的字符串

x = set('runoob')
y = set('google')
print x
print y
print x, y
print x & y  # 并集
print x | y  # 合集
print x - y  # 差集






























